# Assignment 8, Part 2: Pandas Practice

Use this notebook to follow along wit the tasks in the `AO4-Pandas_Part2.ipynb` notebook.

## Instructions
For each task, use the cell below to write and test your code.  You may add additional cells for any task as needed or desired.

## Task 1a: Setup

Prepare the practice notebook:
- import pandas
- re-create the `df` data frame
- re-create the `iris_df` data frame

In [1]:
import pandas as pd
import numpy as np

## Task 2a: Inserting Columns

Create a copy of `df`, and modify it:

+ add a new column to the `
+ select and set values using a boolean operator.

In [2]:
df = pd.DataFrame(
    {'alpha': [0, 1, 2, 3, 4],
     'beta': ['a', 'b', 'c', 'd', 'e']})

In [3]:
iris_df = pd.read_csv('data/iris.csv')

## Task 3a: Missing Data

Create two new copies of the `df` dataframe:

+ One with the `NaN` values replaced with a value of your choice.
+ One with the rows with `NaN` values removed.

In [7]:
df['epsilon'] = pd.Series([1, 2, 3])
df1=df.fillna(2)
df1

   alpha beta  epsilon
0      0    a      1.0
1      1    b      2.0
2      2    c      3.0
3      3    d      2.0
4      4    e      2.0

## Task 4a: Operations

View the [Computational tools](https://pandas.pydata.org/pandas-docs/stable/user_guide/computation.html) and [statistical methods](https://pandas.pydata.org/pandas-docs/stable/user_guide/computation.html#method-summary) documentation.
Using the list of operational functions choose 5 to practice using the iris data frame.

In [9]:
iris_df.std().head()

sepal_length    0.828066
sepal_width     0.433594
petal_length    1.764420
petal_width     0.763161
dtype: float64

In [10]:
iris_df.mean().head()

sepal_length    5.843333
sepal_width     3.054000
petal_length    3.758667
petal_width     1.198667
dtype: float64

In [11]:
iris_df.min().head()

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

In [12]:
iris_df.max().head()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [13]:
iris_df.corr().head()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.109369      0.871754     0.817954
sepal_width      -0.109369     1.000000     -0.420516    -0.356544
petal_length      0.871754    -0.420516      1.000000     0.962757
petal_width       0.817954    -0.356544      0.962757     1.000000

## Task 4b:  Apply
Practice using `apply` on either the `df` or `iris_df` data frames using any two functions of your choice.

In [14]:
iris_df.apply(type)

sepal_length    <class 'pandas.core.series.Series'>
sepal_width     <class 'pandas.core.series.Series'>
petal_length    <class 'pandas.core.series.Series'>
petal_width     <class 'pandas.core.series.Series'>
species         <class 'pandas.core.series.Series'>
dtype: object

In [15]:
iris_df.apply(np.sum)

sepal_length                                                876.5
sepal_width                                                 458.1
petal_length                                                563.8
petal_width                                                 179.8
species         setosasetosasetosasetosasetosasetosasetosaseto...
dtype: object

## Task 4c.  Occurances
Ientify the number of occurances for each species (virginica, versicolor, setosa) in the `iris_df` object.  *Hint*: the `value_counts` function only works on a `pd.Series` object, not on the full data frame.

In [19]:
iris_df.species.value_counts()

versicolor    50
virginica     50
setosa        50
Name: species, dtype: int64

## Task 5a: String Methods

Demonstrate the spliting and combination of columns.

+ Create your list of words, as shown above.
+ Combine two or more columns into one. *You can use string combinations, or do math on numeric columns.*
+ Split a column into two.

In [20]:
labels = ['alpha', 'beta', 'gamma', 'delta']
more_labels = ['foxtrot', 'whiskey', 'omega','epsilon','startrek']

In [21]:
df['iota'] = np.random.choice(labels, df.shape[0])
df['kappa'] = np.random.choice(more_labels, df.shape[0])
df

   alpha beta  epsilon   iota     kappa
0      0    a      1.0  alpha   whiskey
1      1    b      2.0   beta  startrek
2      2    c      3.0  delta  startrek
3      3    d      NaN  alpha   foxtrot
4      4    e      NaN   beta   foxtrot

In [22]:
df['lambda'] = df['iota'] + '_' + df['kappa']
df

   alpha beta  epsilon   iota     kappa          lambda
0      0    a      1.0  alpha   whiskey   alpha_whiskey
1      1    b      2.0   beta  startrek   beta_startrek
2      2    c      3.0  delta  startrek  delta_startrek
3      3    d      NaN  alpha   foxtrot   alpha_foxtrot
4      4    e      NaN   beta   foxtrot    beta_foxtrot

In [23]:
df['lambda'].str
df['lambda'].str.split('_')

0     [alpha, whiskey]
1     [beta, startrek]
2    [delta, startrek]
3     [alpha, foxtrot]
4      [beta, foxtrot]
Name: lambda, dtype: object

In [25]:
split_1, split_2 = df['lambda'].str.split('_', 1).str
split_1

0    alpha
1     beta
2    delta
3    alpha
4     beta
Name: lambda, dtype: object

In [26]:
df['split_1'], df['split_2'] = df['lambda'].str.split('_', 1).str
df

   alpha beta  epsilon   iota     kappa          lambda split_1   split_2
0      0    a      1.0  alpha   whiskey   alpha_whiskey   alpha   whiskey
1      1    b      2.0   beta  startrek   beta_startrek    beta  startrek
2      2    c      3.0  delta  startrek  delta_startrek   delta  startrek
3      3    d      NaN  alpha   foxtrot   alpha_foxtrot   alpha   foxtrot
4      4    e      NaN   beta   foxtrot    beta_foxtrot    beta   foxtrot

## Task 6a: Concat and append data frames

Create two new dataframes and use them to demonstrate use of the following functions:

+ `pd.concat()`
+ `df.append()`

In [31]:
setosa_df = iris_df[iris_df['species'] == 'setosa']
versicolor_df = iris_df[iris_df['species'] == 'versicolor']
virginica_df = iris_df[iris_df['species'] == 'virginica']
pieces = [setosa_df, versicolor_df, virginica_df]
setosa_df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [32]:
versicolor_df.head()

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
51           6.4          3.2           4.5          1.5  versicolor
52           6.9          3.1           4.9          1.5  versicolor
53           5.5          2.3           4.0          1.3  versicolor
54           6.5          2.8           4.6          1.5  versicolor

In [33]:

virginica_df.head()

     sepal_length  sepal_width  petal_length  petal_width    species
100           6.3          3.3           6.0          2.5  virginica
101           5.8          2.7           5.1          1.9  virginica
102           7.1          3.0           5.9          2.1  virginica
103           6.3          2.9           5.6          1.8  virginica
104           6.5          3.0           5.8          2.2  virginica

In [29]:
new_iris_df = pd.concat(pieces)
new_iris_df.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

## Task 6b: Grouping


Demonstrate a `groupby`.

+ Create a new column with the label `region` in the iris data frame. This column will indicates geographic regions of the US where measurments were taken. Values should include:  'Southeast', 'Northeast', 'Midwest', 'SouthWest', 'Pacific Northwest. (These can be randomly assigned).
+ Use `groupby` to get a new data frame of means for each species in each region.
+ Add the `dev_stage` column using the commands shown in section 6.3
+ Use `groupby` to get a new data frame of means for each species,in each region and each development stage.
+ Use the `count` function (just like you used the `mean` function) to identify how many rows in the table belong to each combination of species + region + developmental stage.